plant-api-backend/app/controllers/api/v1/cares_controller.rb

SELECT "cares".* FROM "cares"
---
    def index
        cares = Care.all