plant-api-backend/app/controllers/api/v1/plants_controller.rb

    def index
        #binding.pry
        plants = Plant.all
---
SELECT "plants".* FROM "plants"

    def show
        plant = Plant.find(params[:id])
---
SELECT "plants".* FROM "plants" WHERE "plants"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def create
        #binding.pry
    plant = Plant.new(checks_params)
        cares = params[:cares].map { |care| Care.find_or_create_by(maintenance: care, light: care, fertilization:care ) }
        plant.cares << cares
        plant.save
---
INSERT INTO "cares" ("maintenance", "light", "fertilization", "plant_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["maintenance", ""], ["light", ""], ["fertilization", ""], ["plant_id", 7], ["created_at", "2020-07-16 23:05:20.971415"], ["updated_at", "2020-07-16 23:05:20.971415"]]
SELECT "cares".* FROM "cares" WHERE "cares"."maintenance" = ? AND "cares"."light" = ? AND "cares"."fertilization" = ? LIMIT ?  [["maintenance", ""], ["light", ""], ["fertilization", ""], ["LIMIT", 1]]
INSERT INTO "plants" ("name", "image", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "j"], ["image", ""], ["description", ""], ["created_at", "2020-07-16 23:05:20.963014"], ["updated_at", "2020-07-16 23:05:20.963014"]]